{
  "protein_structure": [
    {
      "title": "Designing de novo TIM Barrels: Insights into Stabilization,\n  Diversification, and Functionalization Strategies",
      "summary": "The TIM-barrel fold is one of the most versatile and ubiquitous protein folds\nin nature, hosting a wide variety of catalytic activities and functions while\nserving as a model system in protein biochemistry and engineering. This review\nexplores its role as a key fold model in protein design, particularly in\naddressing challenges in stabilization and functionalization. We discuss\nhistorical and recent advances in de novo TIM barrel design from the landmark\ncreation of sTIM11 to the development of the diversified variants, with a\nspecial focus on deepening our understanding of the determinants that modulate\nthe sequence-structure-function relationships of this architecture. Also, we\nexamine why the diversification of de novo TIM barrels towards\nfunctionalization remains a major challenge, given the absence of natural-like\nactive site features. Current approaches have focused on incorporating\nstructural extensions, modifying loops, and using cutting-edge AI-based\nstrategies to create scaffolds with tailored characteristics. Despite\nsignificant advances, achieving enzymatically active de novo TIM barrels has\nbeen proven difficult, with only recent breakthroughs demonstrating\nfunctionalized designs. We discuss the limitations of stepwise\nfunctionalization approaches and support an integrated approach that\nsimultaneously optimizes scaffold structure and active site shape, using both\nphysical- and AI-driven methods. By combining computational and experimental\ninsights, we highlight the TIM barrel as a powerful template for custom enzyme\ndesign and as a model system to explore the intersection of protein\nbiochemistry, biophysics, and design.",
      "link": "http://arxiv.org/abs/2508.05699v1",
      "published": "2025-08-06T22:49:42Z",
      "authors": "Julian Beck, Sergio Romero-Romero",
      "topic": "protein_structure"
    },
    {
      "title": "Separate-scan atomic force microscope for fast infrared scattering-type\n  scanning near-field optical microscope",
      "summary": "Pseudo-heterodyne scattering-type scanning near-field optical microscopy\n(sSNOM) is applied in the mid-infrared region to detect the chemical\ncomposition of biomolecules on the nanoscale. However, the application of sSNOM\nin molecular biology has been limited to static images in air. Recently, bottom\nillumination sSNOM (BI-sSNOM) was developed for operation in water. Yet, the\nscan rate of sSNOM remains a bottleneck to record protein structural changes in\naqueous solution on the seconds time scale. We designed an optical and\nmechanical system consisting of a separate scan high-speed atomic force\nmicroscope (HS-AFM) coupled to the BI-sSNOM optics. The designed AFM scanner\nhas a mechanical bandwidth of ca 70 kHz along the Z-axis, and ca 6 kHz along\nthe XY-axis, equivalent to the sample scanning HS-AFM. The AFM performance is\ndemonstrated by imaging actin filaments. The optical design is validated by\nsSNOM experiments on purple membranes and microtubules.",
      "link": "http://arxiv.org/abs/2508.02877v1",
      "published": "2025-08-04T20:11:51Z",
      "authors": "Yusuke Sakiyama, Emanuel Pfitzner, Santiago H. Andany, Georg E. Fantner, Joachim Heberle",
      "topic": "protein_structure"
    }
  ],
  "dna_binding": [
    {
      "title": "Alz-QNet: A Quantum Regression Network for Studying Alzheimer's Gene\n  Interactions",
      "summary": "Understanding the molecular-level mechanisms underpinning Alzheimer's disease\n(AD) by studying crucial genes associated with the disease remains a challenge.\nAlzheimer's, being a multifactorial disease, requires understanding the\ngene-gene interactions underlying it for theranostics and progress. In this\narticle, a novel attempt has been made using a quantum regression to decode how\nsome crucial genes in the AD Amyloid Beta Precursor Protein ($APP$), Sterol\nregulatory element binding transcription factor 14 ($FGF14$), Yin Yang 1\n($YY1$), and Phospholipase D Family Member 3 ($PLD3$) etc. become influenced by\nother prominent switching genes during disease progression, which may help in\ngene expression-based therapy for AD. Our proposed Quantum Regression Network\n(Alz-QNet) introduces a pioneering approach with insights from the\nstate-of-the-art Quantum Gene Regulatory Networks (QGRN) to unravel the gene\ninteractions involved in AD pathology, particularly within the Entorhinal\nCortex (EC), where early pathological changes occur. Using the proposed\nAlz-QNet framework, we explore the interactions between key genes ($APP$,\n$FGF14$, $YY1$, $EGR1$, $GAS7$, $AKT3$, $SREBF2$, and $PLD3$) within the CE\nmicroenvironment of AD patients, studying genetic samples from the database\n$GSE138852$, all of which are believed to play a crucial role in the\nprogression of AD. Our investigation uncovers intricate gene-gene interactions,\nshedding light on the potential regulatory mechanisms that underlie the\npathogenesis of AD, which help us to find potential gene inhibitors or\nregulators for theranostics.",
      "link": "http://arxiv.org/abs/2508.04743v1",
      "published": "2025-08-06T04:31:49Z",
      "authors": "Debanjan Konar, Neerav Sreekumar, Richard Jiang, Vaneet Aggarwal",
      "topic": "dna_binding"
    }
  ],
  "bioinformatics": [
    {
      "title": "Dynamics of Protonated Oxalate from Machine-Learned Simulations and\n  Experiment: Infrared Signatures, Proton Transfer Dynamics and Tunneling\n  Splittings",
      "summary": "The infrared spectroscopy and proton transfer dynamics together with the\nassociated tunneling splittings for H/D-transfer in oxalate are investigated\nusing a machine learning-based potential energy surface (PES) of CCSD(T)\nquality, calibrated against the results of new spectroscopic measurements.\nSecond order vibrational perturbation calculations (VPT2) very successfully\ndescribe both the framework and H-transfer modes compared with the experiments.\nIn particular, a new low-intensity signature at 1666 cm$^{-1}$ was correctly\npredicted from the VPT2 calculations. An unstructured band centered at 2940\ncm$^{-1}$ superimposed on a broad background extending from 2600 to 3200\ncm$^{-1}$ is assigned to the H-transfer motion. The broad background involves a\nmultitude of combination bands but a major role is played by the COH-bend. For\nthe deuterated species, VPT2 and molecular dynamics simulations provide equally\nconvincing assignments, in particular for the framework modes. Finally, based\non the new PES the tunneling splitting for H-transfer is predicted as\n$\\Delta_{\\rm H} = 35.0$ cm$^{-1}$ from ring polymer instanton calculations\nusing higher-order corrections. This provides an experimentally accessible\nbenchmark to validate the computations, in particular the quality of the\nmachine-learned PES.",
      "link": "http://arxiv.org/abs/2508.06419v1",
      "published": "2025-08-08T16:06:29Z",
      "authors": "Valerii Andreichev, Silvan Käser, Erica L. Bocanegra, Madeeha Salik, Mark A. Johnson, Markus Meuwly",
      "topic": "bioinformatics"
    },
    {
      "title": "On-the-Fly Machine Learning of Interatomic Potentials for Elastic\n  Property Modeling in Al-Mg-Zr Solid Solutions",
      "summary": "The development of resilient and lightweight Aluminum alloys is central to\nadvancing structural materials for energy-efficient engineering applications.\nTo address this challenge, in this study, we explore the elastic properties of\nAl-Mg-Zr solid solutions by integrating advanced machine learning (ML)\ntechniques with quantum-mechanical (QM) atomistic simulations. For this\npurpose, we develop accurate and transferable machine-learned interatomic\npotentials (MLIPs) using two complementary approaches: (i) an on-the-fly\nlearning scheme combined with Bayesian linear regression during ab initio\nmolecular dynamics simulations, and (ii) the equivariant neural network\narchitecture MACE. Both MLIPs facilitate the prediction of\ncomposition-dependent elastic properties while drastically reducing the\ncomputational cost compared to conventional QM methods. Comparison with\nultrasonic measurements shows that the deviation between simulation and\nexperiment remains within a few GPa across all Al-Mg-Zr systems investigated.\nThese potentials also enable the systematic exploration of the Al-Mg-Zr solid\nsolution phase space and provide insights into the elastic behavior as a\nfunction of alloying element concentration. Hence, our findings demonstrate the\nreliability and transferability of the parameterized on-the-fly MLIPs, making\nthem valuable for accelerating the design of Al alloys with tailored\nphysicomechanical properties in complex compositional spaces. While the present\nstudy focuses on homogeneous phases, it establishes a foundation for future\nmultiscale simulations that include microstructural features such as\nprecipitates and grain boundaries.",
      "link": "http://arxiv.org/abs/2508.06311v1",
      "published": "2025-08-08T13:37:23Z",
      "authors": "Lukas Volkmer, Leonardo Medrano Sandonas, Philip Grimm, Julia Kristin Hufenbach, Gianaurelio Cuniberti",
      "topic": "bioinformatics"
    },
    {
      "title": "Revealing the Staging Structural Evolution and Li (De)Intercalation\n  Kinetics in Graphite Anodes via Machine Learning Potential",
      "summary": "Revealing the dynamic structural evolution and lithium transport properties\nduring the charge/discharge processes is crucial for optimizing graphite anodes\nin lithium-ion batteries, enabling high stability and fast-charging\nperformance. However, the dynamic coupling mechanisms among carbon layer\nkinetics, lithium (de)intercalation/diffusion, and defects regulation remain\ninsufficiently understood. In this study, we developed a universal automated\nworkflow based on machine learning potentials to simulate the dynamic lithium\n(de)intercalation process. With this approach, the staging structural evolution\nof lithium-graphite intercalation compounds and their lithium transport\nbehavior were resolved through molecular dynamics simulations. By introducing\nstacking faults into the graphite structure, we successfully simulated stage\ntransitions driven by carbon layer sliding and reorganization, accompanied by\nstress release and structural stabilization. The dynamics of carbon layers\nregulate the lithium (de)intercalation positional selectivity, producing\nintermediate states with varying lithium concentrations and distributions\nduring cycling. This facilitates the formation and transformation of stage\nstructures while mitigating residual stress accumulation. A fundamental kinetic\nasymmetry arises between lithium intercalation and deintercalation, driven by\nthe continuous and heterogeneous lithium transport and carbon layer sliding\nduring charge/discharge processes. The carbon defects regulate lithium\ntransport, in which the atomic-scale defects confine intralayer lithium\ntransport and carbon sliding while enabling interlayer transport via dynamic\nlithium trapping/release mechanisms. Accordingly, for the future design, it is\ncritical to construct structural units with controllable carbon layer\nsliding/reorganization, and tunable defects to enhance lithium-ion transport.",
      "link": "http://arxiv.org/abs/2508.06156v1",
      "published": "2025-08-08T09:24:59Z",
      "authors": "Liqi Wang, Xuhe Gong, Zicun Li, Ruijuan Xiao, Hong Li",
      "topic": "bioinformatics"
    },
    {
      "title": "Advancing Material Modeling in Hydrocodes Beyond Equations of State",
      "summary": "We present a multiscale simulation framework that couples the Finite Element\nMethod with molecular dynamics. Bypassing traditional equations of state (EOS)\nby using in-line atomistic simulations, the method offers the advantage of\nincorporating detailed microscale physics not easily represented with\ncoarse-grained models. Coupling consistency with the continuum code is ensured\nthrough the use of lifting and restriction operators, in line with\nheterogeneous multiscale methods. The concurrent continuum-atomistic framework\nis validated through comparison with experimental results and conventional EOS\nmodels, and demonstrated in a shock-driven hydrodynamic flow simulation under\nextreme conditions. We further evaluate the framework's usability by comparing\nit to state-of-the-art EOS models of deuterium. A computational performance\nstudy reveals that the atomistic EOS evaluation is a feasible alternative to\nconventional approaches, and demonstrates a weak scaling of 99% efficiency.\nThese results highlight the framework's potential for large-scale multiscale\nmodeling across a broad range of materials and conditions.",
      "link": "http://arxiv.org/abs/2508.06012v1",
      "published": "2025-08-08T04:53:06Z",
      "authors": "Tim A. Linke, Dane M. Sterbentz, Jean-Pierre R. Delplanque, Sebastien Hamel, Kevin A. Korner, Philip C. Myint, Lorin X. Benedict, Jonathan L. Belof",
      "topic": "bioinformatics"
    },
    {
      "title": "Unveiling the Lithium-Ion Transport Mechanism in Li2ZrCl6 Solid-State\n  Electrolyte via Deep Learning-Accelerated Molecular Dynamics Simulations",
      "summary": "Lithium zirconium chlorides (LZCs) present a promising class of\ncost-effective solid electrolyte for next-generation all-solid-state batteries.\nThe unique crystal structure of LZCs plays a crucial role in facilitating\nlithium-ion mobility, which is central to their electrochemical performance. To\nunderstand the underlying mechanism governing ion transport, we employed deep\nlearning-accelerated molecular dynamics simulation on Li2ZrCl6 (trigonal\n{\\alpha}- and monoclinic \\b{eta}-LZC), focusing specifically on the zirconium\ncoordination environment. Our results reveal that disordered {\\alpha}-LZC\nexhibits the highest ionic conductivity, while \\b{eta}-LZC demonstrates\nsignificantly lower conductivity, closely aligning with experimental findings.\nDetailed analysis shows substantial differences in lithium-ion dynamics:\n{\\alpha}-LZC phases display pronounced collective diffusion driven anisotropic\ninterlayer transport, whereas lithium mobility in \\b{eta}-LZC is largely\ndetermined by isotropic translations and individual diffusion dominated by\nintralayer migration. Across all phases, lithium migration proceeds via\nsite-to-site hopping mechanism, where variations in site residence times\ncritically impact the overall ionic conductivity. Local structure organizations\nanalysis confirms that particular zirconium arrangements in LZC phases create\nvaried ion channel energy barriers, influencing dynamic behaviors: In\n{\\alpha}-LZC phases, the interlayer hopping barrier is lower than the\nintralayer barrier, facilitating faster ion transport. Disordered {\\alpha}-LZC,\nwith its loose zirconium arrangement, presents the lowest energy barrier,\nenhancing conductivity. Conversely, \\b{eta}-LZC features a higher overall\nbarrier, with intralayer hopping favored over interlayer, resulting in slower\nion migration.",
      "link": "http://arxiv.org/abs/2508.05598v1",
      "published": "2025-08-07T17:41:11Z",
      "authors": "Hanzeng Guo, Volodymyr Koverga, Selva Chandrasekaran Selvaraj, Anh T. Ngo",
      "topic": "bioinformatics"
    },
    {
      "title": "Ta2Pd3Te8: A potential candidate of 1D van der Waals stacked\n  thermoelectric materials",
      "summary": "Discovering new thermoelectric (TE) materials is an eternal goal in the TE\nfield. Excellent TE materials have ranged from 3D stacked to 2D stacked bulk.\nHowever, the 1D stacked receives little attention due to the scarcity in\nquantity. In this work, it is predicted that 1D van der Waals (vdW) stacked\nTa2Pd3Te8 crystal is a compelling candidate for TE applications by combining\nfirst-principles calculations with phonon and electron Boltzmann transport\nequations and molecular dynamics methods. We find that Ta2Pd3Te8 crystal has\nmechanical, dynamical, and thermal stabilities, and its TE properties are\nfeatured by strong anisotropy, high power factor (PF) and low lattice thermal\nconductivity. The results indicate the ZT values of n-type Ta2Pd3Te8 at 900 K\nalong a, b and c axes reach 0.48, 0.39 and 0.22, respectively. We propose that\nenlarging the bandgap can weaken the bipolar effect and thus significantly\nincreases ZT to 1.11. The findings in the work not only stimulate more\ntheoretical works on 1D vdW stacked TE materials, but also provide valuable\ninformation for experimentally improving TE materials.",
      "link": "http://arxiv.org/abs/2508.05549v1",
      "published": "2025-08-07T16:28:03Z",
      "authors": "Shi Chen, Aijun Hong, Junming Liu",
      "topic": "bioinformatics"
    },
    {
      "title": "The Role of Counterions in the Assembly of Charged Virus-Like Shells",
      "summary": "Synthetic virus-like particles (VLP), designed from simplified building\nblocks, can reduce the complexity of native viral proteins and be tailored for\nspecific applications. Using molecular dynamics simulations, we investigate the\nrole of counterions (H2PO4-, PO43-, Cl-, and F-) in stabilizing a pre-assembled\nvirus-like shell formed by cationic peptides exemplified by synthetic\ncyclopeptide (sequence: cyc-Gln-DLeu-Arg-DLeu-Arg-DLeu-Arg-DLeu) VLP shells.\nOur findings reveal that polyatomic anions (H2PO4- and PO43-) facilitate stable\nassemblies by condensing on the VLP shell to higher degrees, thereby\nneutralizing Coulombic repulsion among the peptide building blocks. Cohesion is\nlargely promoted through the multidentate hydrogen bonds with arginine:\nSubstituting arginine by lysine in the system with H2PO4- leads to\ndestabilization of the structure. H2PO4- additionally engages in hydrophobic\ninteractions with leucine side chains. By contrast, monoatomic anions (Cl- and\nF-) show insufficient coordination to the peptides and fail to stabilize the\nassembly, while supplementing F- with excess 1M NaCl can recover the structural\nintegrity by screening electrostatic interactions. This study provides\nimportant insights into the role of counterions in molecular self-assembly and\nthe nature of their interactions with amino-acid side chains involved in the\ncooperative formation and stabilization of synthetic virus-like shells.",
      "link": "http://arxiv.org/abs/2508.05723v1",
      "published": "2025-08-07T16:02:50Z",
      "authors": "Ya-Wen Hsiao, Magnus Hedström, Maxim G Ryadnov, David J Bray, Jason Crain",
      "topic": "bioinformatics"
    },
    {
      "title": "Best practices for nonadiabatic molecular dynamics simulations",
      "summary": "Nonadiabatic molecular dynamics simulations aim to describe the coupled\nelectron-nuclear dynamics of molecules in excited electronic states. These\nsimulations have been applied to understand a plethora of photochemical and\nphotophysical processes, and, as a result, the number of nonadiabatic dynamics\nsimulations has been growing significantly over the past decade. Yet, the field\nremains in its infancy, and a potential user may find it difficult to approach\nthis type of simulation, given their complexity and the number of elements that\nshould be considered for a (hopefully) successful nonadiabatic dynamics\nsimulation. Nonadiabatic molecular dynamics relies on several key steps:\nfinding a level of electronic-structure theory to describe the molecule in its\nFranck-Condon region and beyond, describing the photoexcitation process,\nselecting a method to perform the nonadiabatic dynamics, and analyzing the\nfinal results before calculating observables for a more direct comparison with\nexperiment. This Best Practices aims to provide a general guide for the user of\nnonadiabatic molecular dynamics by (i) discussing the fundamentals of\nnonadiabatic molecular dynamics and the various trajectory-based methods\ndeveloped for molecular systems, (ii) introducing the different\nelectronic-structure methods and concepts - adiabatic/diabatic representation,\nconical intersections - that can be used with nonadiabatic molecular dynamics\n(or for benchmarking), (iii) providing details on the various steps required to\nperform a nonadiabatic dynamics simulation and their practical use, as well as\nguided examples and a discussion on the calculation of observables, (iv)\nproposing a FAQ with the typical questions a user may have when performing\nnonadiabatic dynamics, and (v) sketching a checklist for the key practical\nsteps when performing a (trajectory-based) nonadiabatic molecular dynamics.",
      "link": "http://arxiv.org/abs/2508.05263v1",
      "published": "2025-08-07T10:57:28Z",
      "authors": "Antonio Prlj, Jack T. Taylor, Jiří Janoš, Petr Slavíček, Federica Agostini, Basile F. E. Curchod",
      "topic": "bioinformatics"
    },
    {
      "title": "Alpha-, Beta-, and Gamma-TODD-G: Novel 2D Planar Carbon Allotropes",
      "summary": "We present a comprehensive first-principles investigation of three novel\ntwo-dimensional carbon allotropes: alpha-, beta-, and gamma-TODD-Graphene\n(TODD-G), composed of 3-8-12-16, 3-8-12-16, and 3-4-8-12 interconnected carbon\nrings with sp/sp2 hybridization, respectively. Structural optimization, phonon\nspectra, and ab initio molecular dynamics simulations confirm their thermal and\ndynamical stability. All phases exhibit metallic electronic behavior, with\ndistinct Dirac-like features and tilted Dirac cones that suggest anisotropic\ncharge transport. Mechanical analysis reveals tunable anisotropy: alpha-TODD-G\nis strongly anisotropic, beta-TODD-G shows moderate anisotropy, and\ngamma-TODD-G displays an almost isotropic mechanical response. Optical spectra\nfurther differentiate the phases, with gamma-TODD-G showing strong absorption\nin the infrared region, while alpha- and beta-TODD-G mainly absorb in the\nvisible and ultraviolet ranges.",
      "link": "http://arxiv.org/abs/2508.05013v1",
      "published": "2025-08-07T03:50:10Z",
      "authors": "Kleuton A. L. Lima, Jose A. S. Laranjeira, Alysson M. A. Silva, Bill. D. Aparicio-Huacarpuma, Fabrício M. Vasconcelos, Julio R. Sambrano, Douglas S. Galvão, Luiz A. Ribeiro Junior",
      "topic": "bioinformatics"
    },
    {
      "title": "The Docking Game: Loop Self-Play for Fast, Dynamic, and Accurate\n  Prediction of Flexible Protein-Ligand Binding",
      "summary": "Molecular docking is a crucial aspect of drug discovery, as it predicts the\nbinding interactions between small-molecule ligands and protein pockets.\nHowever, current multi-task learning models for docking often show inferior\nperformance in ligand docking compared to protein pocket docking. This\ndisparity arises largely due to the distinct structural complexities of ligands\nand proteins. To address this issue, we propose a novel game-theoretic\nframework that models the protein-ligand interaction as a two-player game\ncalled the Docking Game, with the ligand docking module acting as the ligand\nplayer and the protein pocket docking module as the protein player. To solve\nthis game, we develop a novel Loop Self-Play (LoopPlay) algorithm, which\nalternately trains these players through a two-level loop. In the outer loop,\nthe players exchange predicted poses, allowing each to incorporate the other's\nstructural predictions, which fosters mutual adaptation over multiple\niterations. In the inner loop, each player dynamically refines its predictions\nby incorporating its own predicted ligand or pocket poses back into its model.\nWe theoretically show the convergence of LoopPlay, ensuring stable\noptimization. Extensive experiments conducted on public benchmark datasets\ndemonstrate that LoopPlay achieves approximately a 10\\% improvement in\npredicting accurate binding modes compared to previous state-of-the-art\nmethods. This highlights its potential to enhance the accuracy of molecular\ndocking in drug discovery.",
      "link": "http://arxiv.org/abs/2508.05006v2",
      "published": "2025-08-07T03:38:28Z",
      "authors": "Youzhi Zhang, Yufei Li, Gaofeng Meng, Hongbin Liu, Jiebo Luo",
      "topic": "bioinformatics"
    },
    {
      "title": "Growth of few-layer molecular crystals of PTCDI on hexagonal boron\n  nitride by microspacing air-gap sublimation",
      "summary": "Extended two-dimensional (2D) crystals of dye molecules adsorbed on 2D\nmaterial substrates like boron nitride have recently become a subject of\nintense study, with potential applications ranging from quantum technology to\noptoelectronics. The most established technique for the production of these\nfilms is physical vapor transport in vacuum. We demonstrate that few-layer\ncrystalline films of the organic dye molecule PTCDI on boron nitride can be\nproduced by microspacing in-air sublimation, a radically simplified technique,\nnot requiring complicated vacuum systems. The resulting layers display clearly\nresolved atomic step terraces in atomic force microscopy, and a clear\npolarization anisotropy in their fluorescence, confirming molecular alignment\nand long-range order. Using density functional theory and classical molecular\ndynamics simulations, the canted motive is identified as the most likely\nbuilding block for the morphology of a PTDCI monolayer on the hBN substrate.",
      "link": "http://arxiv.org/abs/2508.04591v1",
      "published": "2025-08-06T16:09:22Z",
      "authors": "Nils LeCoutre, Tolibjon Abdurakhmonov, Paul Weinbrenner, Kenji Watanabe, Takashi Taniguchi, Tobias Korn, Franziska Fennel, Oliver Kühn, Friedemann Reinhard",
      "topic": "bioinformatics"
    },
    {
      "title": "$β$-Irida-Graphene: A New 2D Carbon Allotrope for Sodium-Ion Battery\n  Anodes",
      "summary": "The quest for sustainable and efficient energy storage has driven the\nexploration of sodium-ion batteries (SIBs) as promising alternatives to\nlithium-ion systems. However, the larger ionic radius of sodium poses intrinsic\nchallenges such as slow diffusion and structural strain in conventional\nelectrode materials. As a contribution to addressing these limitations, the\n\\b{eta}-Irida-graphene ($\\beta$-IG) is herein introduced, a novel\ntwo-dimensional (2D) carbon allotrope derived from Irida-graphene, featuring a\ndiverse polygonal lattice of 3-, 4-, 6-, 8-, and 9-membered carbon rings.\nThrough density functional theory and ab initio molecular dynamics simulations,\n$\\beta$-IG demonstrated remarkable thermal, dynamical, and mechanical\nstability, coupled with intrinsic conductive character and efficient sodium-ion\nmobility (energy barriers < 0.30 eV). Furthermore, the adsorption of sodium\nions was energetically favorable, delivering an impressive predicted specific\ncapacity of 554.5 mAh/g. The reported findings highlight $\\beta$-IG as a good\npotential anode candidate for next-generation SIBs, offering high-rate\nperformance and structural robustness, and expanding the functional design\nspace for advanced carbon-based electrode materials.",
      "link": "http://arxiv.org/abs/2508.04506v1",
      "published": "2025-08-06T14:51:36Z",
      "authors": "José A. S. Laranjeira, Kleuton A. L. Lima, Nicolas F. Martins, Luiz A. Ribeiro Junior, Douglas S. Galvão, Luis A. Cabral, Julio R. Sambrano",
      "topic": "bioinformatics"
    },
    {
      "title": "Structural and helix reversal defects of carbon nanosprings",
      "summary": "Due to their chiral structure, carbon nanosprings possess unique properties\nthat are promising for nanotechnology applications. The structural\ntransformations of carbon nanosprings in the form of spiral macromolecules\nderived from planar coronene and kekulene molecules (graphene helicoids and\nspiral nanoribbons) are analyzed using molecular dynamics simulations. While\nthe tension/compression of such nanosprings has been analyzed in the\nliterature, this study investigates other modes of deformation, including\nbending and twisting. Depending on the geometric characteristics of the carbon\nnanosprings, the formation of structural and helix reversal defects is\ndescribed. It is found that nanosprings demonstrate a significantly higher\ncoefficient of axial thermal expansion than many metals and alloys. These\nresults are useful for designing nanosensors that operate over a wide\ntemperature range.",
      "link": "http://arxiv.org/abs/2508.04490v1",
      "published": "2025-08-06T14:38:38Z",
      "authors": "Alexander V. Savin, Elena A. Korznikova, Sergey V. Dmitriev",
      "topic": "bioinformatics"
    },
    {
      "title": "Thermoresponsive copolymer microgels synthesized via single-step\n  precipitation polymerization: random or block structure?",
      "summary": "The inner structure of polymeric particles critically influences their phase\nbehavior and functionality, governing their mechanical properties and their\nphysical and chemical interactions. For thermoresponsive microgels, i.e.\ncolloidal particles comprising a crosslinked polymer network that undergo a\nvolume transition upon temperature changes, structural control is key to tailor\nthe material responsivity and broaden the range of applications. In this work,\nwe present a comprehensive investigation of the internal structure of\npoly(N-isopropylacrylamide-co-N-isopropylmethacrylamide), P(NIPAM-co-NIPMAM),\ncopolymer microgels, combining small-angle neutron scattering (SANS), dynamic\nlight scattering (DLS), and nuclear magnetic resonance (NMR) measurements with\nmulti-scale simulations. By synthesizing different samples, we probe the\nmicrogels swelling behavior, revealing distinct signatures of the individual\npolymers. To elucidate their internal distribution, we perform monomer-resolved\nmicrogel simulations across different copolymer models. A direct comparison\nbetween experimental and numerical form factors under different,\nneutron-selective conditions provides evidence of a preferential organization\ninto block structures rather than a random arrangement. These results are\nconfirmed by 13C-NMR which reveals the clear presence of NIPAM blocks within a\nmore random arrangement of the remaining monomers and by atomistic molecular\ndynamics simulations on copolymer chains, which also shed light on a possible\norigin in the dependence of the hydrogen bonding capability on the local\nenvironment. These findings provide a detailed microscopic picture of the inner\narchitecture of P(NIPAM-co-NIPMAM) microgels, revealing an unexpected\nstructural organization that may be generalized to other copolymer systems and\ncould be promising to tailor microgel design and enhance control of material\nresponsivity.",
      "link": "http://arxiv.org/abs/2508.04246v1",
      "published": "2025-08-06T09:29:45Z",
      "authors": "Letizia Tavagnacco, Elena Buratti, Jacopo Vialetto, Francesco Brasili, Elisa Ballin, Kuno Schwärzer, Jitendra Mata, Graziano Di Carmine, Monica Bertoldo, Ester Chiessi, Marco Laurati, Emanuela Zaccarelli",
      "topic": "bioinformatics"
    },
    {
      "title": "Hybrid Quantum--Classical Machine Learning Potential with Variational\n  Quantum Circuits",
      "summary": "Quantum algorithms for simulating large and complex molecular systems are\nstill in their infancy, and surpassing state-of-the-art classical techniques\nremains an ever-receding goal post. A promising avenue of inquiry in the\nmeanwhile is to seek practical advantages through hybrid quantum-classical\nalgorithms, which combine conventional neural networks with variational quantum\ncircuits (VQCs) running on today's noisy intermediate-scale quantum (NISQ)\nhardware. Such hybrids are well suited to NISQ hardware. The classical\nprocessor performs the bulk of the computation, while the quantum processor\nexecutes targeted sub-tasks that supply additional non-linearity and\nexpressivity. Here, we benchmark a purely classical E(3)-equivariant\nmessage-passing machine learning potential (MLP) against a hybrid\nquantum-classical MLP for predicting density functional theory (DFT) properties\nof liquid silicon. In our hybrid architecture, every readout in the\nmessage-passing layers is replaced by a VQC. Molecular dynamics simulations\ndriven by the HQC-MLP reveal that an accurate reproduction of high-temperature\nstructural and thermodynamic properties is achieved with VQCs. These findings\ndemonstrate a concrete scenario in which NISQ-compatible HQC algorithm could\ndeliver a measurable benefit over the best available classical alternative,\nsuggesting a viable pathway toward near-term quantum advantage in materials\nmodeling.",
      "link": "http://arxiv.org/abs/2508.04098v1",
      "published": "2025-08-06T05:30:25Z",
      "authors": "Soohaeng Yoo Willow, D. ChangMo Yang, Chang Woo Myung",
      "topic": "bioinformatics"
    },
    {
      "title": "Constructing Generalized Sample Transition Probabilities with Biased\n  Simulations",
      "summary": "In molecular dynamics (MD) simulations, accessing transition probabilities\nbetween states is crucial for understanding kinetic information, such as\nreaction paths and rates. However, standard MD simulations are hindered by the\ncapacity to visit the states of interest, prompting the use of enhanced\nsampling to accelerate the process. Unfortunately, biased simulations alter the\ninherent probability distributions, making kinetic computations using\ntechniques such as diffusion maps challenging. Here, we use a coarse-grained\nMarkov chain to estimate the intrinsic pairwise transition probabilities\nbetween states sampled from a biased distribution. Our method, which we call\nthe generalized sample transition probability (GSTP), can recover transition\nprobabilities without relying on an underlying stochastic process and\nspecifying the form of the kernel function, which is necessary for the\ndiffusion map method. The proposed algorithm is validated on model systems such\nas a harmonic oscillator, alanine dipeptide in vacuum, and met-enkephalin in\nsolvent. The results demonstrate that GSTP effectively recovers the unbiased\neigenvalues and eigenstates from biased data. GSTP provides a general framework\nfor analyzing kinetic information in complex systems, where biased simulations\nare necessary to access longer timescales.",
      "link": "http://arxiv.org/abs/2508.03977v1",
      "published": "2025-08-06T00:05:08Z",
      "authors": "Yanbin Wang, Jakub Rydzewski, Ming Chen",
      "topic": "bioinformatics"
    },
    {
      "title": "FlowBack-Adjoint: Physics-Aware and Energy-Guided Conditional\n  Flow-Matching for All-Atom Protein Backmapping",
      "summary": "Coarse-grained (CG) molecular models of proteins can substantially increase\nthe time and length scales accessible to molecular dynamics simulations of\nproteins, but recovery of accurate all-atom (AA) ensembles from CG simulation\ntrajectories can be essential for exposing molecular mechanisms of folding and\ndocking and for calculation of physical properties requiring atomistic detail.\nThe recently reported deep generative model FlowBack restores AA detail to\nprotein C-alpha traces using a flow-matching architecture and demonstrates\nstate-of-the-art performance in generation of AA structural ensembles.\nTraining, however, is performed exclusively on structural data and the absence\nof any awareness of interatomic energies or forces within training results in\nsmall fractions of incorrect bond lengths, atomic clashes, and otherwise\nhigh-energy structures. In this work, we introduce FlowBack-Adjoint as a\nlightweight enhancement that upgrades the pre-trained FlowBack model through a\none-time, physics-aware post-training pass. Auxiliary contributions to the flow\nintroduce physical awareness of bond lengths and Lennard-Jones interactions and\ngradients of a molecular mechanics force field energy are incorporated via\nadjoint matching to steer the FlowBack-Adjoint vector field to produce\nlower-energy configurations. In benchmark tests against FlowBack,\nFlowBack-Adjoint lowers single-point energies by a median of ~78\nkcal/mol.residue, reduces errors in bond lengths by >92%, eliminates >98% of\nmolecular clashes, maintains excellent diversity of the AA configurational\nensemble, and produces configurations capable of initializing stable all-atom\nmolecular dynamics simulations without requiring energy relaxation. We propose\nFlowBack-Adjoint as an accurate and efficient physics-aware deep generative\nmodel for AA backmapping from C-alpha traces.",
      "link": "http://arxiv.org/abs/2508.03619v1",
      "published": "2025-08-05T16:35:39Z",
      "authors": "Alex Berlaga, Michael S. Jones, Andrew L. Ferguson",
      "topic": "bioinformatics"
    },
    {
      "title": "Molecular dynamics of ice-active solutions at ice-water interfaces",
      "summary": "Small molecules that interact strongly with water were the subject of this\nmolecular dynamics (MD) study. These solutes include a cryoprotectant (DMSO), a\npolyalcohol [CH$_2$(OH)$_2$], carboxylic acid conjugates (HCOOH and HCOONa), an\nammonium salt (NH$_4$Cl), and two alkyl halide salts (NaCl and NaF). MD\nsimulations were carried out for bulk supercooled liquids and solutions in\ncontact with ice. Solute and water hydrogen bonding, orientational and\ntranslational order, and hydrogen bond jump dynamics were compared in bulk and\nas a function of distance from the solute molecules. Reverse non-equilibrium\nmolecular dynamics (RNEMD) simulations were used to determine interfacial\nwidths, friction coefficients ($\\kappa$) with ice, and solution phase\nviscosities ($\\eta$). Ionic solutes were found to reduce orientational and\ntranslational ordering near the ice interfaces. However, in bulk liquids, we\nfind a correlation between orientational ordering and the statistics of water\nhydrogen bonds -- a donor-acceptor imbalance in water has the greatest impact\non ordering in the bulk liquids. Although ionic solutions exhibited similar\neffects on the water structure, the effect on dynamics depends most directly on\ndonor-acceptor imbalance. Solutes that are hydrogen bond acceptors were found\nto slow hydrogen bond lifetimes relative to hydrogen bond donors. We also\nobserved a direct correlation between the liquid phase hydrogen-bond jump times\nand shear viscosity. Finally, of all the solutes studied, only DMSO and sodium\nformate exhibited increased friction at the ice-water interface.",
      "link": "http://arxiv.org/abs/2508.03591v1",
      "published": "2025-08-05T15:57:50Z",
      "authors": "Benjamin M. Harless, Jasmine K. Sindelar, J. Daniel Gezelter",
      "topic": "bioinformatics"
    },
    {
      "title": "Understanding protein function with a multimodal retrieval-augmented\n  foundation model",
      "summary": "Protein language models (PLMs) learn probability distributions over natural\nprotein sequences. By learning from hundreds of millions of natural protein\nsequences, protein understanding and design capabilities emerge. Recent works\nhave shown that scaling these models improves structure prediction, but does\nnot seem to improve mutation understanding and representation quality for\nprotein function prediction. We introduce PoET-2, a multimodal,\nretrieval-augmented protein foundation model that incorporates in-context\nlearning of family-specific evolutionary constraints with optional structure\nconditioning to learn generative distributions over protein sequences. PoET-2\nuses a hierarchical transformer encoder that is equivariant to sequence context\nordering and a dual decoder architecture with both causal and masked language\nmodeling objectives, allowing PoET-2 to operate in both fully generative and\nbidirectional representation learning modes. PoET-2 achieves state-of-the-art\nperformance on zero-shot variant effect prediction, excelling at scoring\nvariants with multiple mutations and challenging indel mutations. In supervised\nsettings, PoET-2 embeddings outperform previous methods for learning\nsequence-function relationships, especially with small datasets. This work\nhighlights the benefits of combining retrieval augmentation with multimodal,\nfamily-centric modeling for advancing protein foundation models.",
      "link": "http://arxiv.org/abs/2508.04724v1",
      "published": "2025-08-05T15:11:25Z",
      "authors": "Timothy Fei Truong Jr, Tristan Bepler",
      "topic": "bioinformatics"
    },
    {
      "title": "Decoding Polyphenol-Protein Interactions with Deep Learning: From\n  Molecular Mechanisms to Food Applications",
      "summary": "Polyphenols and proteins are essential biomolecules that influence food\nfunctionality and, by extension, human health. Their interactions -- hereafter\nreferred to as PhPIs (polyphenol-protein interactions) -- affect key processes\nsuch as nutrient bioavailability, antioxidant activity, and therapeutic\nefficacy. However, these interactions remain challenging due to the structural\ndiversity of polyphenols and the dynamic nature of protein binding. Traditional\nexperimental techniques like nuclear magnetic resonance (NMR) and mass\nspectrometry (MS), along with computational tools such as molecular docking and\nmolecular dynamics (MD), have offered important insights but face constraints\nin scalability, throughput, and reproducibility. This review explores how deep\nlearning (DL) is reshaping the study of PhPIs by enabling efficient prediction\nof binding sites, interaction affinities, and MD using high-dimensional bio-\nand chem-informatics data. While DL enhances prediction accuracy and reduces\nexperimental redundancy, its effectiveness remains limited by data\navailability, quality, and representativeness, particularly in the context of\nnatural products. We critically assess current DL frameworks for PhPIs analysis\nand outline future directions, including multimodal data integration, improved\nmodel generalizability, and development of domain-specific benchmark datasets.\nThis synthesis offers guidance for researchers aiming to apply DL in unraveling\nstructure-function relationships of polyphenols, accelerating discovery in\nnutritional science and therapeutic development.",
      "link": "http://arxiv.org/abs/2508.03456v1",
      "published": "2025-08-05T13:56:22Z",
      "authors": "Qiang Liu, Tiantian Wang, Binbin Nian, Feiyang Ma, Siqi Zhao, Andrés F. Vásquez, Liping Guo, Chao Ding, Mehdi D. Davari",
      "topic": "bioinformatics"
    },
    {
      "title": "Machine learning potential for predicting thermal conductivity of\n  θ-phase and amorphous Tantalum Nitride",
      "summary": "Tantalum nitride (TaN) has attracted considerable attention due to its unique\nelectronic and thermal properties, high thermal conductivity, and applications\nin electronic components. However, for the {\\theta}-phase of TaN, significant\ndiscrepancies exist between previous experimental measurements and theoretical\npredictions. In this study, deep potential models for TaN in both the\n{\\theta}-phase and amorphous phase were developed and employed in molecular\ndynamics simulations to investigate the thermal conductivities of bulk and\nnanofilms. The simulation results were compared with reported experimental and\ntheoretical results, and the mechanism for differences were discussed. This\nstudy provides insights into the thermal transport mechanisms of TaN, offering\nguidance for its application in advanced electronic and thermal management\ndevices.",
      "link": "http://arxiv.org/abs/2508.03297v1",
      "published": "2025-08-05T10:17:36Z",
      "authors": "Zhicheng Zong, Yangjun Qin, Jiahong Zhan, Haisheng Fang, Nuo Yang",
      "topic": "bioinformatics"
    },
    {
      "title": "Pseudo-grand canonical molecular dynamics via volumetrically controlled\n  osmotic pressure",
      "summary": "Molecular dynamics simulations are typically constrained to have a fixed\nnumber of particles, which limits our capability to simulate chemical and\nphysical processes where the composition of the system changes during the\nsimulation time. Typical examples are the calculation of nucleation and crystal\ngrowth rates in heterogeneous solutions where the driving force depends on the\ncomposition of the fluid. Constant chemical potential molecular dynamics\nsimulations would instead be required to compute time-independent growth and\nnucleation rates. While this can, in principle, be achieved through the\naddition and deletion of particles using the grand canonical partition\nfunction, this is very inefficient in the condensed phase due to the low\nacceptance probability of these events. Adaptive resolution schemes, which use\na reservoir of non-interacting particles that can be transformed into solute\nparticles, circumvent this problem, but at the cost of relatively complicated\ncode implementations. In this work, a simpler approach is proposed that uses\nharmonic volumetric restraints to control the solute osmotic pressure, which\ncan be considered a proxy for the system's chemical potential. The osmotic\npressure regulator is demonstrated to reproduce the expected properties of\nideal gases and ideal solutions. Using the mW water model, the osmotic pressure\nregulator is shown to provide a constant growth rate for ice in the presence of\nan electrolyte solution, unlike what standard molecular dynamics simulations\nwould produce.",
      "link": "http://arxiv.org/abs/2508.03051v1",
      "published": "2025-08-05T03:55:18Z",
      "authors": "Blake I. Armstrong, Aaron D. Copeland, Davide Donadio, Paolo Raiteri",
      "topic": "bioinformatics"
    },
    {
      "title": "Enhancing the ergodicity of Worldvolume HMC via embedding\n  Generalized-thimble HMC",
      "summary": "The Worldvolume Hybrid Monte Carlo (WV-HMC) method [arXiv:2012.08468] is an\nefficient and versatile algorithm that simultaneously mitigates both the sign\nproblem and the ergodicity problem -- the latter being intrinsic to algorithms\nbased on Lefschetz thimbles. We consider a situation in which the maximum flow\ntime can be set to a small value, as occurs when WV-HMC is applied to the doped\nHubbard model using a nonphysical redundant parameter. An optimal choice of\nthis parameter significantly reduces the sign problem on the original\nintegration surface and allows the maximum flow time to remain small, a feature\nthat facilitates increasing the system size while keeping the computation time\nmodest. However, as the worldvolume becomes a thin layer, it becomes\nincreasingly difficult to explore it efficiently, leading to potential\nergodicity issues. To overcome this limitation, we propose embedding the\nGeneralized-thimble HMC (GT-HMC) into the WV-HMC framework. GT-HMC performs HMC\nupdates on a deformed surface at a fixed flow time. Although it suffers from\nergodicity issues due to infinitely high potential barriers at the zeros of the\nBoltzmann weight, it enables more efficient exploration within the allowed\nregion. Furthermore, its molecular dynamics step size can typically be taken to\nbe larger than in WV-HMC. GT-HMC is thus better suited for sampling regions\nwhere ergodicity issues are not serious. We provide a proof that GT-HMC can be\nembedded within the WV-HMC algorithm, and verify that the two methods -- the\npure WV-HMC and the combined version -- yield consistent results within\nstatistical errors for the two-dimensional doped Hubbard model on a $6 \\times\n6$ spatial lattice at $T/\\kappa = 1/6.4\\simeq 0.156$ and $U/\\kappa = 8.0$ with\nTrotter number $N_t = 20$ ($\\kappa$: hopping parameter).",
      "link": "http://arxiv.org/abs/2508.02659v1",
      "published": "2025-08-04T17:49:31Z",
      "authors": "Masafumi Fukuma, Yusuke Namekawa",
      "topic": "bioinformatics"
    }
  ]
}